* Specifications

Ent is a build tool like ant but working inside emacs and using elisp
instead of XML.

* Implementation
** [2010-12-21 Tue] fileind file in project
#+begin_src
    (defun my-ido-project-files ()
      "Use ido to select a file from the project."
      (interactive)
      (let (my-project-root project-files tbl)
      (unless project-details (project-root-fetch))
      (setq my-project-root (cdr project-details))

      ;; get project files
      (setq project-files 
	    (split-string 
	     (shell-command-to-string 
	      (concat "find "
		      my-project-root
		      " \\( -name \"*.svn\" -o -name \"*.git\" \\) -prune -o -type f -print | grep -E -v \"\.(pyc)$\""
		      )) "\n"))
      ;; populate hash table (display repr => path)
      (setq tbl (make-hash-table :test 'equal))
      (let (ido-list)
      (mapc (lambda (path)

	      ;; format path for display in ido list
	      (setq key (replace-regexp-in-string "\\(.*?\\)\\([^/]+?\\)$" "\\2|\\1" path))
	      ;; strip project root
	      (setq key (replace-regexp-in-string my-project-root "" key))
	      ;; remove trailing | or /
	      (setq key (replace-regexp-in-string "\\(|\\|/\\)$" "" key))
	      (puthash key path tbl)
	      (push key ido-list)
	      )
	    project-files
	    )
      (find-file (gethash (ido-completing-read "project-files: " ido-list) tbl)))))

    ;; bind to a key for quick access
    (define-key global-map [f6] 'my-ido-project-files)
#+end_src

* Tasks                                                              :@admin:
#+BEGIN: clocktable :maxlevel 2 :scope file
Clock summary at [2010-12-23 Thu 17:55]

| Headline                                    | Time   |      |
|---------------------------------------------+--------+------|
| *Total time*                                | *8:09* |      |
|---------------------------------------------+--------+------|
| Tasks                                       | 8:09   |      |
| \__ DONE [#B] create ent project            |        | 0:45 |
| \__ DONE [#A] convert ebld code to ent code |        | 4:19 |
| \__ DONE [#A] add genautoload task          |        | 0:35 |
| \__ DONE [#A] set build file to auto...     |        | 0:34 |
| \__ DONE [#B] create command for finding... |        | 1:00 |
| \__ DONE [#A] create command to open...     |        | 0:56 |
#+END:
** TODO [#B] create an ob file for xml
   SCHEDULED: <2011-01-14 Fri>
   [2011-01-08 Sat]
** TODO [#B] create a task for batch tangling
   SCHEDULED: <2011-01-14 Fri>
  [2011-01-10 Mon]
[[file:~/.emacs.d/contrib/dpom/.build.el::(setq%20ent-clean-regexp%20"~$\\|dpom-.*\.elc?$\\|semantic\.cache")][file:~/.emacs.d/contrib/dpom/.build.el::(setq ent-clean-regexp "~$\\|dpom-.*\.elc?$\\|semantic\.cache")]]

** DONE [#B] create ent project
   SCHEDULED: <2010-12-13 Mon> CLOSED: [2010-12-13 Mon 18:25]
                                                                       :LOGBOOK:
   CLOCK: [2010-12-13 Mon 18:18]--[2010-12-13 Mon 18:25] =>  0:07
   CLOCK: [2010-12-13 Mon 11:01]--[2010-12-13 Mon 11:14] =>  0:13
   CLOCK: [2010-12-13 Mon 10:50]--[2010-12-13 Mon 10:52] =>  0:02
   CLOCK: [2010-12-13 Mon 10:23]--[2010-12-13 Mon 10:46] =>  0:23
                                                                           :END:
                                                                    :PROPERTIES:
   :Effort:   1:00
                                                                           :END:
   [2010-10-28 Thu]
** DONE [#A] convert ebld code to ent code                            :computer:
   SCHEDULED: <2010-12-16 Thu> CLOSED: [2010-12-19 Sun 20:01]
                                                                       :LOGBOOK:
   CLOCK: [2010-12-19 Sun 19:46]--[2010-12-19 Sun 20:01] =>  0:15
   CLOCK: [2010-12-19 Sun 19:25]--[2010-12-19 Sun 19:35] =>  0:10
   CLOCK: [2010-12-19 Sun 18:38]--[2010-12-19 Sun 19:25] =>  0:47
   CLOCK: [2010-12-19 Sun 18:31]--[2010-12-19 Sun 18:38] =>  0:07
   CLOCK: [2010-12-19 Sun 13:46]--[2010-12-19 Sun 14:54] =>  1:08
   CLOCK: [2010-12-19 Sun 11:08]--[2010-12-19 Sun 11:13] =>  0:05
   CLOCK: [2010-12-19 Sun 05:18]--[2010-12-19 Sun 06:09] =>  0:51
   CLOCK: [2010-12-18 Sat 22:08]--[2010-12-18 Sat 23:04] =>  0:56
                                                                           :END:
                                                                    :PROPERTIES:
   :Effort:   1:00
                                                                           :END:
** DONE [#A] add genautoload task                                     :computer:
   SCHEDULED: <2010-12-20 Mon> CLOSED: [2010-12-20 Mon 12:03]
                                                                       :LOGBOOK:
   CLOCK: [2010-12-20 Mon 12:00]--[2010-12-20 Mon 12:03] =>  0:03
   CLOCK: [2010-12-20 Mon 11:35]--[2010-12-20 Mon 11:52] =>  0:17
   CLOCK: [2010-12-20 Mon 10:57]--[2010-12-20 Mon 11:12] =>  0:15
                                                                           :END:
                                                                    :PROPERTIES:
   :Effort:   0:30
                                                                           :END:
** DONE [#A] set build file to auto install ent package               :computer:
   SCHEDULED: <2010-12-20 Mon> CLOSED: [2010-12-20 Mon 12:24]
                                                                       :LOGBOOK:
   CLOCK: [2010-12-20 Mon 10:56]--[2010-12-20 Mon 11:30] =>  0:34
                                                                           :END:
** DONE [#B] create command for finding file in project http://www.emacswiki.org/emacs/InteractivelyDoThings#toc12 :net:
   SCHEDULED: <2010-12-20 Mon> CLOSED: [2010-12-23 Thu 17:54]
   :LOGBOOK:
   CLOCK: [2010-12-23 Thu 17:46]--[2010-12-23 Thu 17:54] =>  0:08
   CLOCK: [2010-12-22 Wed 18:29]--[2010-12-22 Wed 18:46] =>  0:17
   CLOCK: [2010-12-22 Wed 17:16]--[2010-12-22 Wed 17:51] =>  0:35
   :END:
** DONE [#A] create command to open specific project config file   :computer:
   SCHEDULED: <2010-12-20 Mon> CLOSED: [2010-12-20 Mon 18:04]
                                                                       :LOGBOOK:
                                                                       CLOCK: [2010-12-23 Thu 17:54]--[2010-12-23 Thu 18:12] =>  0:18
   CLOCK: [2010-12-20 Mon 16:58]--[2010-12-20 Mon 17:54] =>  0:56
                                                                           :END:
   
** TODO [#B] create tests                                          :computer:
   SCHEDULED: <2011-01-17 Mon>
   :PROPERTIES:
   :Effort:   2:00
   :END:

   


** TODO write documentation
** TODO put project on github

* COMMENT Setup
#+STARTUP: overview
#+STARTUP: logdone
#+PROPERTY: Effort_ALL  0:10 0:20 0:30 1:00 2:00 4:00 6:00 8:00
#+COLUMNS: %38ITEM(Details) %TAGS(Context) %7TODO(To Do) %5Effort(Time){:} %6CLOCKSUM{Total}
